In [ ]:
# Listas : Serie

In [ ]:
# Series (array) vs Numpy
# Dataframes (filas y columnas) #Indices y nombres ()
# Paneles (+ 2 dimensiones)

In [1]:
#Estas son las 3 formas para importar una librerias 

import pandas as pd 

import pandas 

from pandas import (

    read_csv,
    read_xml,
    read_excel
)

In [ ]:
data = []

In [ ]:
df =

In [2]:
#Crear un dataframe desde un diccionario 

data = {
'Nombre' : ['Juan', 'Luis','Julian'],
'Edad' : [25,24,34]
}

df = pd.DataFrame(data)

In [3]:
df

   Nombre  Edad
0    Juan    25
1    Luis    24
2  Julian    34

In [6]:
#leer un archivo csv local 
df = pd.read_csv('./utils/data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [9]:
df = pd.read_csv('./utils/data/data_without_header',
                 header=None,
                 names= ['Nombre','edad','ciudad']
                 )
df

  Nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [13]:
#Leer un archivo sin extension con un diferente separador 

df = pd.read_csv('./utils/data/data',
                 
                 sep= '|'
                 )
        

df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla